[
  {
    "title": "2019 City of Aurora MLK Celebration",
    "date": "January 30, 2019",
    "content": "On Monday, January 21st, members from the Naperville branch of The Power Up Project attended and accepted awards at the annual MLK Day Celebration in Aurora. These members, including (from left to right in the cover image) Vincent Lee, Thomas Andreas, Jeffrey Cheng, Taylor Xia, Mitchell Zhen, and Eric Chen, received the 2019 Mayor's Service Above Self Award for their donation of 8 refurbished computers to the Simply Destinee, an Aurora based youth center. In the coming week, PUP will be visiting Simply Destinee to finalize this donation.{{0}}{{1}}"
  },
  {
    "title": "Donating to Simply Destinee Youth Center",
    "date": "February 15, 2019",
    "content": "Aurora IL-- Today, PUP members Eric Chen, Jeffrey Cheng, Kevin Shi, Taylor Xia, and Mitchell Zhen drove out to the Simply Destinee Youth Center in Aurora to complete the donation of 8 computers plus peripherals. This inventory included six PCs, one iMac, one laptop, five monitors, six sets of keyboard and mice, and required cables. There, with the help of the City of Aurora IT department, PUP set up the computers for student use.{{0}}{{1}}"
  },
  {
    "title": "Cycle 2 Begins!",
    "date": "June 25, 2019",
    "content": "Naperville, IL--The second cycle of the Power Up Project commences! After a quite successful first cycle, our organization is now looking to improve efficiency and to expand. This first month of June, we are looking to collect even more computers and related devices than our last collection cycle with the hopes of being able to donate to multiple youth centers in one cycle. In addition, we have sought and will continue to seek new members from high schools in the region to meet this goal.\n\nOur first week has stayed true to this path. By the time of our kickoff meeting, we had more than doubled our amount of dedicated and hard working club members, and this number is projected only to grow. After the first week of door-to-door collection in multiple neighborhoods, we acquired 10 PCs, 6 laptops, and even more peripherals.\n\nWe are always looking for more donations, so if you have anything to contribute, feel free to head over to the \"Donate\" page of our website and fill out the donation form at the bottom of the page."
  },
  {
    "title": "Donating to Fuerza Youth Center!",
    "date": "November 27, 2019",
    "content": "After 5 months of hard work, the Naperville branch PUP team has collected and refurbished over 30 computers!\n\nOn Friday last week, PUP members Eric Chen, Jeff Cheng, Jimit Gosar, Helenna Gu, Nick Liu, Josh Tennyson, Kevin Xu, and I went out to Fuerza Youth Center in Cicero, IL to donate a freshly refurbished computer lab of 5 PCs plus peripherals. Huge thanks to Eric's dad and my dad for offering to drive us!\n\nAfter a brief conversation with Fuerza's friendly managers, our team brought in the donation. Though there was no dedicated space with enough outlets to set up all five computers at the moment, we managed to establish a desk in the game room on which one tower could be set up. Then, because two of our PCs used Linux Mint instead of Windows, we set about teaching the kids at Fuerza how to use the OS.{{0}}The youth at Fuerza were really intrigued by the prospect of learning more about computers. Two teens stood out in particular for their intent interest: Yair, a sophomore, and Tristann, a senior.{{1}}Throughout the evening, I talked with Yair and Tristann about their past experience with computers and where their interest in tech started. As it turns out, a computer science graduate from Morton College by the name of Sergio used to come to Fuerza to teach the kids there about computer repair and maintenance, but for the last few months he's been too busy with work to teach them. Yair said that they've been eager to build their own computers for a while, but haven't gotten the chance.\n\nThe computers we left them will be a great opportunity for Yair, Tristann, and all the other kids at Fuerza to play around and further their experience with computers!{{2}}"
  },
  {
    "title": "Collection from Chase",
    "date": "March 13, 2020",
    "content": "{{0}}On Thursday afternoon, PUP team members Nicolas, Eric, and the two Kevins drove out to Chase to collect their old, unused PCs, monitors, and peripherals. Thank you Chase!{{1}}Soon after, they brought this collection to Nick's house. Next year, Nick will be the new Refurbishment Center Leader of the Power Up Project. Congrats!"
  }
]